ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
            <register>
              <name>CFG0L</name>
              <description>This register contains fields that configure the DMA transfer.</description>
              <addressOffset>0x040</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000E00</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RSVDCFG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CHPRIOR</name>
                  <description>Channel Priority.</description>
                  <lsb>5</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>CH_PRIOR_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_4</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_5</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_6</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PRIOR_7</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CHSUSP</name>
                  <description>Channel Suspend.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_SUSPENDED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUSPENDED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FIFOEMPTY</name>
                  <description>Channel FIFO status.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_EMPTY</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EMPTY</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>HSSELDST</name>
                  <description>Destination Software or Hardware Handshaking Select.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>HARDWARE_HS</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SOFTWARE_HS</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>HSSELSRC</name>
                  <description>Source Software or Hardware Handshaking Select.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>HARDWARE_HS</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SOFTWARE_HS</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDLOCKCHL</name>
                  <description>Reserved field - read-only</description>
                  <lsb>12</lsb>
                  <msb>13</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDLOCKBL</name>
                  <description>Reserved field - read-only</description>
                  <lsb>14</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDLOCKCH</name>
                  <description>Reserved field - read-only</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDLOCKB</name>
                  <description>Reserved field - read-only</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DSTHSPOL</name>
                  <description>Destination Handshaking Interface Polarity.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ACTIVE_HIGH</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE_LOW</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SRCHSPOL</name>
                  <description>Source Handshaking Interface Polarity.</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ACTIVE_HIGH</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE_LOW</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MAXABRST</name>
                  <description>Maximum AMBA Burst Length.</description>
                  <lsb>20</lsb>
                  <msb>29</msb>
                </field>
                <field>
                  <name>RSVDRELOADSRC</name>
                  <description>Reserved field - read-only</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRELOADDST</name>
                  <description>Reserved field- read-only</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CFG0H</name>
              <description>This register contains fields that configure the DMA transfer.</description>
              <addressOffset>0x044</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>FCMODE</name>
                  <description>Flow Control Mode.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FCMODE_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FCMODE_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FIFOMODE</name>
                  <description>FIFO Mode Select.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FIFO_MODE_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_MODE_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PROTCTL</name>
                  <description>Protection Control bits used to drive the AHB HPROT[3:1] bus.</description>
                  <lsb>2</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>RSVDDSUPDEN</name>
                  <description>Reserved field- read-only</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSSUPDEN</name>
                  <description>Reserved field- read-only</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SRCPER</name>
                  <description>Source Hardware Interface.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>RSVD1CFG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>8</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DESTPER</name>
                  <description>Destination hardware interface.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>RSVD2CFG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>12</lsb>
                  <msb>14</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD3CFG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>15</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DSR0</name>
              <description>Destination Scatter register.</description>
              <addressOffset>0x050</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DSI</name>
                  <description>Destination Scatter Interval.</description>
                  <lsb>0</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>DSC</name>
                  <description>Destination Scatter Count.</description>
                  <lsb>20</lsb>
                  <msb>24</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CH1</name>
            <description>Unspecified</description>
            <headerStructName>I3CCORE_DMA_CH1</headerStructName>
            <access>read-write</access>
            <addressOffset>0x058</addressOffset>
            <register>
              <name>SAR1</name>
              <description>This register contains the source address of the DMA transfer.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SAR</name>
                  <description>Current Source Address of DMA transfer.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DAR1</name>
              <description>This register contains the destination address of the DMA transfer.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DAR</name>
                  <description>Current Destination address of DMA transfer.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
