ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
            <register>
              <name>DMACOMPPARAMS1L</name>
              <description>DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about the component parameter settings.</description>
              <addressOffset>0x058</addressOffset>
              <access>read-write</access>
              <resetValue>0x33333333</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHOMAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH0_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH1MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH1_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH2_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>8</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH3MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH3_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>12</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH4MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH4_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH5MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH5_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>20</lsb>
                  <msb>23</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH6MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH6_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>24</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_4095</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH7MAXBLKSIZE</name>
                  <description>The values of these bit fields are derived from the DMAH_CH7_MAX_BLK_SIZE coreConsultant parameter.</description>
                  <lsb>28</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_15</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_31</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_63</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_127</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_255</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_511</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_1023</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_BLOCK_SIZE_2047</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
