ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_CTI210">
      <name>GLOBAL_CTI211</name>
      <description>Cross-Trigger Interface control 1</description>
      <baseAddress>0xBF047000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_ATBREPLICATOR210</name>
      <description>ATB Replicator module 0</description>
      <baseAddress>0xBF048000</baseAddress>
      <headerStructName>ATBREPLICATOR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ATBREPLICATOR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>IDFILTER0</name>
          <description>The IDFILTER0 register enables the programming of ID filtering for master port 0.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ID0_00_0F</name>
              <description>Enable or disable ID filtering for IDs 0x00_0x0F.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_10_1F</name>
              <description>Enable or disable ID filtering for IDs 0x10_0x1F.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_20_2F</name>
              <description>Enable or disable ID filtering for IDs 0x20_0x2F.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_30_3F</name>
              <description>Enable or disable ID filtering for IDs 0x30_0x3F.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_40_4F</name>
              <description>Enable or disable ID filtering for IDs 0x40_0x4F.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_50_5F</name>
              <description>Enable or disable ID filtering for IDs 0x50_0x5F.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_60_6F</name>
              <description>Enable or disable ID filtering for IDs 0x60_0x6F.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID0_70_7F</name>
              <description>Enable or disable ID filtering for IDs 0x70_0x7F.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDFILTER1</name>
          <description>The IDFILTER1 register enables the programming of ID filtering for master port 1.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ID1_00_0F</name>
              <description>Enable or disable ID filtering for IDs 0x00_0x0F.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_10_1F</name>
              <description>Enable or disable ID filtering for IDs 0x10_0x1F.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_20_2F</name>
              <description>Enable or disable ID filtering for IDs 0x20_0x2F.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_30_3F</name>
              <description>Enable or disable ID filtering for IDs 0x30_0x3F.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_40_4F</name>
              <description>Enable or disable ID filtering for IDs 0x40_0x4F.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_50_5F</name>
              <description>Enable or disable ID filtering for IDs 0x50_0x5F.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_60_6F</name>
              <description>Enable or disable ID filtering for IDs 0x60_0x6F.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1_70_7F</name>
              <description>Enable or disable ID filtering for IDs 0x70_0x7F.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFiltered</name>
                  <description>Transactions with these IDs are passed on to ATB master port 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>Transactions with these IDs are discarded by the replicator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR1</name>
          <description>The ITATBCTR1 register returns the value of the atreadym0, atreadym1, and atvalids inputs in integration mode.</description>
          <addressOffset>0xEF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATREADYM0</name>
              <description>Reads the value of the atreadym0 input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATREADYM1</name>
              <description>Reads the value of the atreadym1 input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATVALIDS</name>
              <description>Reads the value of the atvalids input.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR0</name>
          <description>The ITATBCTR0 register controls the value of the atvalidm0, atvalidm1, and atreadys outputs in integration mode.</description>
          <addressOffset>0xEFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALIDM0</name>
              <description>Sets the value of the atvalidm0 output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATVALIDM1</name>
              <description>Sets the value of the atvalidm1 output.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATREADYS</name>
              <description>Sets the value of the atreadys output.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin is logic 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin is logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>The ITCTRL register enables the component to switch from a functional mode, which is the default behavior, 
      to integration mode where the inputs and outputs of the component can be directly controlled for the purposes of integration testing and topology detection.</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration Mode Enable.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Integration mode disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Integration mode enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
