ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GFXPLLPM</name>
      <description>AUXPM</description>
      <baseAddress>0x4900C000</baseAddress>
      <headerStructName>AUXPM</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>AUXPM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Request power up</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Request power up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop requesting power up</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop requesting power up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SETTLED</name>
          <description>LDO settled</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SETTLED</name>
              <description>LDO settled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Enable or disable interrupt for event SETTLED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Write '1' to enable interrupt for event SETTLED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Write '1' to disable interrupt for event SETTLED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SETTLED</name>
              <description>Read pending status of interrupt for event SETTLED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status of AuxPm</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>AuxPm powered up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PowerDown</name>
                  <description>AuxPm powered down</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Powered</name>
                  <description>AuxPm powered up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypassing vref filter for startup boost</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotBypass</name>
                  <description>VrefFilt not bypassed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>VrefFilt bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED</name>
              <description>LDO settled</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSettled</name>
                  <description>AuxPm not settled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Settled</name>
                  <description>AuxPm settled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_AUXPM_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x420</addressOffset>
          <register>
            <name>STARTUPTIME</name>
            <description>Time from pwrup to ready signal (0us-3us)</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000018</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Timer value</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>0 us</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Default</name>
                    <description>1.5 us</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Max</name>
                    <description>3 us</description>
                    <value>0x30</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SHUTDOWNTIME</name>
            <description>Time from shutdown until to ready signal is deasserted (0us-3us)</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000018</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Timer value</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>0 us</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Default</name>
                    <description>1.5 us</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Max</name>
                    <description>3 us</description>
                    <value>0x30</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BYPASSTIME</name>
            <description>Time from ready until bypass vref turned off (7us-40us)</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000070</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Timer value</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>7 us</description>
                    <value>0x070</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Default</name>
                    <description>7 us</description>
                    <value>0x070</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Max</name>
                    <description>40 us</description>
                    <value>0x280</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SETLTIME</name>
            <description>Time from bypass turned off to settled (0us-3us)</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000018</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Timer value</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Min</name>
                    <description>0 us</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Default</name>
                    <description>1.5 us</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Max</name>
                    <description>3 us</description>
                    <value>0x30</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_AUXPM_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x450</addressOffset>
          <register>
            <name>VREFPM</name>
            <description>Reference voltage trimming. Equals output voltage</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage trimming value.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Val800mV</name>
                    <description>800 mV</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val825mV</name>
                    <description>825 mV</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val850mV</name>
                    <description>850 mV</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val900mV</name>
                    <description>900 mV</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val600mV</name>
                    <description>600 mV</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val650mV</name>
                    <description>650 mV</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val700mV</name>
                    <description>700 mV</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Val750mV</name>
                    <description>750 mV</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIRROR</name>
          <description>Enable LOCK for mirrored registers</description>
          <addressOffset>0x4F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock for mirrored registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_AUXPM_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x580</addressOffset>
          <register>
            <name>PWRUP</name>
            <description>Override the pwrup to the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDOENABLE</name>
            <description>Override the LDO enable to the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BLEEDENABLE</name>
            <description>Override the bleed enable to the analog module</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
