ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>MULTIPLICATOR</name>
            <description>Control of the feedback multiplication ratio M.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000028</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>M</name>
                <description>Feedback multiplication ratio</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DIVISOR</name>
            <description>Control of the input frequency division ratio N.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>N</name>
                <description>frequency division ratio</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PROPCNTRL</name>
            <description>Proportional Charge Pump control</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PROPCNTRL</name>
                <description>Proportional Charge Pump control</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTCNTRL</name>
            <description>Integral Charge Pump control</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTCNTRL</name>
                <description>Integral Charge Pump control</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOCNTRL</name>
            <description>VCO operating range, needs to be set appropriately to frequency of operation.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000003E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VCOCNTRL</name>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWERDOWN</name>
                    <description>Unspecified</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ1150MTO1250M</name>
                    <description>1150 MHz to 1250 MHz</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ1110MTO1152M</name>
                    <description>1100 MHz to 1152 MHz</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ630MTO1149M</name>
                    <description>630 MHz to 1149 MHz</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ420MTO660M</name>
                    <description>420 MHz to 660 MHz</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ320MTO440M</name>
                    <description>320 MHz to 440 MHz</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ210MTO330M</name>
                    <description>210 MHz to 330 MHz</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ160MTO220M</name>
                    <description>160 MHz to 220 MHz</description>
                    <value>0x1E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ105MTO165M</name>
                    <description>105 MHz to 165 MHz</description>
                    <value>0x2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ80MTO110M</name>
                    <description>80 MHz to 110 MHz</description>
                    <value>0x2E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ52M5TO82M5</name>
                    <description>52.5 MHz to 82.5 MHz</description>
                    <value>0x2E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FREQ40MTO55M</name>
                    <description>40 MHz to 55 MHz</description>
                    <value>0x3E</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GMPCNTRL</name>
            <description>Controls the effective loop-filter resistance (=1/GMP) to increase/decrease MPLL bandwidth and compensate for change in divider modulus (DIVISOR N).</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GMP</name>
                <description>1/GMP = Loop filter resistance</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPBIASCNTRL</name>
            <description>Charge Pump bias control</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CPBIAS</name>
                <description>Charge Pump bias control</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>PLL lock indication</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCK</name>
                <description>PLL lock indication</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTLOCKED</name>
                    <description>PLL is not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOCKED</name>
                    <description>PLL is locked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCELOCK</name>
            <description>Force lock</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCELOCK</name>
                <description>Force lock indication</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DETECTOR</name>
                    <description>Lock according to lock detector</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FORCED</name>
                    <description>Lock indication forced</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKSEL</name>
            <description>Control of PLL clock output selection. For more information see functional description.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLKSEL</name>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STOPPED</name>
                    <description>Clocks stopped</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GENERATION</name>
                    <description>Clocks generation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFFERED</name>
                    <description>Buffered clkext</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FORBIDDEN</name>
                    <description>Forbidden</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SHADOWCLEAR</name>
            <description>Shadow registers clear</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SHADOWCLEAR</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLEAR</name>
                    <description>Clear shadow registers</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>UPDATEPLL</name>
            <description>Control for PLL operation frequency updated. Write this register to latch PLL control signals from registers to set PLL operating frequency.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UPDATEPLL</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UPDATE</name>
                    <description>Update PLL control signals from registers.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DPHY</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_DPHY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x53C</addressOffset>
          <register>
            <name>RXMODE</name>
            <description>In some configurations of the D-PHY the RX mode needs to be overriden by this register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVERRIDE</name>
                <description>Override the RXMODE signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable override of RXMODE.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable override of RXMODE.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCERXMODE</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Force RX mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Do not force RX mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTEN</name>
            <description>This Register places the macro in IO continuity test mode. All other
        interface signals should be placed in their default values.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONTEN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTDATA</name>
            <description>Continuity data</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REXT</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CLKN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CLKP</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DATAN0</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DATAP0</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>DATAN1</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DATAP2</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGFREQRANGE</name>
            <description>System clock frequency configuration preset.
        Should be set according to the following equation:
        cfgclkfreqrange[7:0] = round[(Fcfg_clk(MHz)-17)*4]</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGFREQRANGE</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HSFREQRANGE</name>
            <description>High-speed Frequency Range Selection.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HSFREQRANGE</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTMODE</name>
            <description>Sets the needed signal values for PHY tests</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SHUTDOWNIDDQ</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Shutdown IDDQ test mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>IDDQ test mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TESTMUX</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_TESTMUX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x554</addressOffset>
          <register>
            <name>TXRXSEL</name>
            <description>Select between TX and RX test signal from D-PHY</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXRXSEL</name>
                <description>TX/RX test mux selection</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RX</name>
                    <description>Select RX test signal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TX</name>
                    <description>Select TX test signal</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IDI</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_IDI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5A0</addressOffset>
          <register>
            <name>DATATYPE</name>
            <description>Data type of the IDI packet.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATATYPE</name>
                <description>Data type according to the CSI specification. Full type value. See functional description for more details.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SUBTYPE</name>
                <description>Data subtype according to the CSI specification. See functional description for more details.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CLASS</name>
                <description>Data type class according to the CSI specification.</description>
                <lsb>3</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SYNC</name>
                    <description>Synchronization short packet data types</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GENERICSHORT</name>
                    <description>Generic short packet data types</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GENERICLONG</name>
                    <description>Generic long packet data types</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>YUV</name>
                    <description>YUV data</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RGB</name>
                    <description>RGB data</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAW</name>
                    <description>RAW data</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTE</name>
                    <description>User Defined byte-based data</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WORDCOUNT</name>
            <description>Number of words in the current packet.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WORDCOUNT</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECC</name>
            <description>Error Correction Code.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECC</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
