ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>VIDSHADOWCTRL</name>
            <description>Controls dpi shadow feature</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDSHADOWEN</name>
                <description>When set to 1, DPI receives the active configuration from the auxiliary registers. When the feature is set at the same time than vid_shadow_req the auxiliary registers are automatically updated.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>VIDSHADOWREQ</name>
                <description>When set to 1, this bit request that the dpi registers from regbank are copied to the auxiliary registers. When the request is completed this bit is auto clear.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>VIDSHADOWPINREQ</name>
                <description>When set to 1, the video request is done by external pin. In this mode vid_shadow_req is ignored.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DPIVCIDACT</name>
            <description>Holds the value that controller is using for DPI_VCID.</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPIVCID</name>
                <description>This field specifies the DPI virtual channel id that is indexed to the Video mode packets.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DPICOLORCODINGACT</name>
            <description>Holds the value that controller is using for DPI_COLOR_CODING.</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPICOLORCODING</name>
                <description>This field configures the DPI color for Video Mode/eDPI Command Mode coding as follows:</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC00</name>
                    <description>16-bit configuration 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC01</name>
                    <description>16-bit configuration 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC02</name>
                    <description>16-bit configuration 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC03</name>
                    <description>18-bit configuration 1</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC04</name>
                    <description>18-bit configuration 2</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC05</name>
                    <description>24-bit</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC06</name>
                    <description>20-bit YCbCr 4:2:2 loosely packed / Reserved for eDPI Command Mode</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC07</name>
                    <description>24-bit YCbCr 4:2:2 / Reserved for eDPI Command Mode</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC08</name>
                    <description>16-bit YCbCr 4:2:2 / Reserved for eDPI Command Mode</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC09</name>
                    <description>30-bit - DSC_ENC 10bit / Reserved for eDPI Command Mode</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC10</name>
                    <description>36-bit / Reserved for eDPI Command Mode</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC11</name>
                    <description>12-bit YCbCr 4:2:0 / Reserved for eDPI Command Mode</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC12</name>
                    <description>DSC24 compressed Data</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC13</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC14</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC15</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOOSELY18EN</name>
                <description>When 1, this bit activates loosely packed variant to 18-bit configurations.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DPILPCMDTIMACT</name>
            <description>Holds the value that controller is using for DPI_LP_CMD_TIM.</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INVACTLPCMDTIME</name>
                <description>This field is used for the transmission of commands in low-power mode. It specifies the size, in bytes, of the largest packet that can fit in a line during the VACT region.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTVACTLPCMDTIME</name>
                <description>This field is used for the transmission of commands in low-power mode. It specifies the size, in bytes, of the largest packet that can fit in a line during the VSA, VBP, and VFP regions.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDMODECFGACT</name>
            <description>Holds the value that controller is using for VID_MODE_CFG.</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDMODETYPE</name>
                <description>This field specifies the video mode transmission type as follows:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VIDMODE0</name>
                    <description>Non-burst with sync pulses</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE1</name>
                    <description>Non-burst with sync events</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE2</name>
                    <description>Burst mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIDMODE3</name>
                    <description>Burst mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPVSAEN</name>
                <description>When 1, this bit enables the return to low-power inside the VSA period when timing allows.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPVBPEN</name>
                <description>When 1, this bit enables the return to low-power inside the VBP period when timing allows.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPVFPEN</name>
                <description>When 1, this bit enables the return to low-power inside the VFP period when timing allows.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPVACTEN</name>
                <description>When 1, this bit enables the return to low-power inside the VACT period when timing allows.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPHBPEN</name>
                <description>When 1, this bit enables the return to low-power inside the HBP period when timing allows.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPHFPEN</name>
                <description>When 1, this bit enables the return to low-power inside the HFP period when timing allows.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FRAMEBTAACKEN</name>
                <description>When 1, this bit enables the request for an acknowledge response at the end of a frame.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LPCMDEN</name>
                <description>When 1, this bit enables the command transmission only in low-power mode.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDPKTSIZEACT</name>
            <description>Holds the value that controller is using for VID_PKT_SIZE.</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDPKTSIZE</name>
                <description>This field specifies the number of pixels in a single video packet. For 18-bit not loosely packed this number must be a multiple of 4 and YCbCr Data Types, it must be a multiple of 2, as described in DSI specification.</description>
                <lsb>0</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDNUMCHUNKSACT</name>
            <description>This register holds the value that controller is using for VID_NUM_CHUNKS.</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDNUMCHUNKS</name>
                <description>This register specifies the number of chunks to be transmitted during a Line period (a chunk is pair made of a video packet and a null packet). If set to 0 or 1, video line is still transmitted in a single packet. If set to 1 that packet is part of a chunk, meaning that a null packet follows it (if vid_null_size&amp;gt;0). Otherwise, multiple chunks are used to transmit each video line.</description>
                <lsb>0</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDNULLSIZEACT</name>
            <description>Holds the value that controller is using for VID_NULL_SIZE.</description>
            <addressOffset>0x144</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDNULLSIZE</name>
                <description>This register specifies the number of bytes inside a null packet. Setting to 0 disables null packets.</description>
                <lsb>0</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHSATIMEACT</name>
            <description>Holds the value that controller is using for VID_HSA_TIME.</description>
            <addressOffset>0x148</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHSATIME</name>
                <description>This field specifies the Horizontal Synchronism Active period in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHBPTIMEACT</name>
            <description>Holds the value that controller is using for VID_HBP_TIME.</description>
            <addressOffset>0x14C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHBPTIME</name>
                <description>This field specifies the Horizontal Back Porch period in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHLINETIMEACT</name>
            <description>Holds the value that controller is using for VID_HLINE_TIME.</description>
            <addressOffset>0x150</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHLINETIME</name>
                <description>This field specifies the size of the total line time (HSA+HBP+HACT+HFP) counted in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVSALINESACT</name>
            <description>Holds the value that controller is using for VID_VSA_LINES.</description>
            <addressOffset>0x154</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VSALINES</name>
                <description>This field specifies the Vertical Synchronism Active period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVBPLINESACT</name>
            <description>Holds the value that controller is using for VID_VBP_LINES.</description>
            <addressOffset>0x158</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VBPLINES</name>
                <description>This field specifies the Vertical Back Porch period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVFPLINESACT</name>
            <description>Holds the value that controller is using for VID_VFP_LINES.</description>
            <addressOffset>0x15C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VFPLINES</name>
                <description>This field specifies the Vertical Front Porch period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVACTIVELINESACT</name>
            <description>Holds the value that controller is using for VID_VACTIVE_LINES.</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VACTIVELINES</name>
                <description>This field specifies the Vertical Active period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDPKTSTATUS</name>
            <description>Contains information about the status of FIFOs related to DPI and eDPI interfaces.</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPICMDWEMPTY</name>
                <description>This bit indicates the empty status of write command FIFO for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPICMDWFULL</name>
                <description>This bit indicates the full status of write command FIFO for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIPLDWEMPTY</name>
                <description>This bit indicates the empty status of write payload FIFO for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIPLDWFULL</name>
                <description>This bit indicates the full status of write payload FIFO for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIBUFFPLDEMPTY</name>
                <description>This bit indicates the empty status of the payload internal buffer for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIBUFFPLDFULL</name>
                <description>This bit indicates the full status of the payload internal buffer for video Mode. This bit is set to 0 for command Mode.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
