ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>GAMMALUT0166</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1298</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0167</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x129C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0168</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0169</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0170</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0171</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0172</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0173</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0174</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0175</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0176</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0177</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0178</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0179</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0180</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0181</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x12D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
