ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>GAMMALUT1246</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1247</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1248</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1249</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1250</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1251</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1252</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1253</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1254</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT1255</name>
            <description>Layer 1 palette/gamma correction memory region.</description>
            <addressOffset>0x17FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT20</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x1800</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT21</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x1804</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT22</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x1808</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT23</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x180C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT24</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x1810</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT25</name>
            <description>Layer 2 palette/gamma correction memory region.</description>
            <addressOffset>0x1814</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
