ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>GAMMALUT3134</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3135</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3136</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3137</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3138</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3139</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3140</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3141</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3142</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3143</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3144</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3145</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3146</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3147</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3148</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT3149</name>
            <description>Layer 3 palette/gamma correction memory region.</description>
            <addressOffset>0x1E54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
