ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
        <cluster>
          <name>TESTMODE2</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_OTPC_TESTMODE2</headerStructName>
          <access>read-write</access>
          <addressOffset>0x620</addressOffset>
          <cluster>
            <name>EMEMORY</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_OTPC_TESTMODE2_EMEMORY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>IN</name>
              <description>Writes directly to the input signals of the OTP macro.</description>
              <addressOffset>0x000</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PTM</name>
                  <description>Test mode enabling.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>PWE</name>
                  <description>Define program cycle.</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PPROG</name>
                  <description>Program Mode enabling.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                </field>
                <field>
                  <name>PCLK</name>
                  <description>Clock input.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                </field>
                <field>
                  <name>PCE</name>
                  <description>IP enabling.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>PTR</name>
                  <description>Test row enable.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>PDSTB</name>
                  <description>Deep standby mode enabling.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>PENVDD2</name>
                  <description>VDD2 enable pin (VDD2 domain).</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>OUT</name>
              <description>Reads directly from the output signals of the OTP macro.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PBUSY</name>
                  <description>Auto enrollment busy pin.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>PS</name>
                  <description>Auto PUF margin read success.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PA</name>
              <description>Writes directly to the address input PA of the OTP macro.</description>
              <addressOffset>0x008</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PA</name>
                  <description>Address input for read/write operation.</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PAIO</name>
              <description>Writes directly to the address input PAIO of the OTP macro</description>
              <addressOffset>0x00C</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PAIO</name>
                  <description>Address input for write operation.</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DATA</name>
              <description>OTP read/write data</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DATA</name>
                  <description>OTP data register</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>COUNTERCONFIG</name>
            <description>Configuration register for the counter.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPERATIONMODE</name>
                <description>Enable counter-triggered latching of read data from OTP.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>The TESTMODE2.EMEMORY.DATA[31:0] register reads the direct value of PDOUT[31:0]
            of eMemory OTP.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Latched</name>
                    <description>The TESTMODE2.EMEMORY.DATA register reads the latched value of PDOUT[31:0] of
            eMemory OTP.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTERSTART</name>
            <description>Starts the counter. Only applicable when TESTMODE2.COUNTERCONFIG.OPERATIONMODE
         = Direct.</description>
            <addressOffset>0x028</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIGGER</name>
                <description>Start the counter.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Start</name>
                    <description>Start the counter. Only applicable when TESTMODE2.COUNTERCONFIG.OPERATIONMODE=Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTERRELOAD</name>
            <description>Reload value for counter.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RELOAD</name>
                <description>This is the counter reload value, used each time the
          decrementing counter is triggered.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTERRUN</name>
            <description>Status of the counter.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RUNNING</name>
                <description>Checks if counter is running.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>Counter is not running.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>Counter is running.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
