ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DEBUGIF</name>
          <description>Unspecified</description>
          <headerStructName>VPR_DEBUGIF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>DATA0</name>
            <description>Abstract Data 0. Read/write data for argument 0</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Abstract Data 0</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA1</name>
            <description>Abstract Data 1. Read/write data for argument 1</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Abstract Data 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMCONTROL</name>
            <description>Debug Module Control</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DMACTIVE</name>
                <description>Reset signal for the debug module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Reset the debug module itself</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Normal operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDMRESET</name>
                <description>Reset signal output from the debug module to the system.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Inactive</name>
                    <description>Reset inactive</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Active</name>
                    <description>Reset active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLRRESETHALTREQ</name>
                <description>Clear the halt on reset request.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the halt on reset request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SETRESETHALTREQ</name>
                <description>Set the halt on reset request.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Sets the halt on reset request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HARTSELHI</name>
                <description>The high 10 bits of hartsel.</description>
                <lsb>6</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>HARTSELLO</name>
                <description>The low 10 bits of hartsel.</description>
                <lsb>16</lsb>
                <msb>25</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>HASEL</name>
                <description>Definition of currently selected harts.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Single</name>
                    <description>Single hart selected.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Multiple</name>
                    <description>Multiple harts selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACKHAVERESET</name>
                <description>Clear the havereset.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the havereset for selected harts.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HARTRESET</name>
                <description>Reset harts.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Deasserted</name>
                    <description>Reset de-asserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Asserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESUMEREQ</name>
                <description>Resume currently selected harts.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Resumed</name>
                    <description>Currently selected harts resumed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HALTREQ</name>
                <description>Halt currently selected harts.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears halt request bit for all currently selected harts.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Halt</name>
                    <description>Currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
