ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>ATSTATR</name>
            <description>Register to read the Center, Left and Right codes used by tuning and auto-tuning engines. Center code field is also used for software managed tuning.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x80000006</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CENTERPHCODE</name>
                <description>Centered Phase code. Reading this field returns the current value on tuning_cclk_sel output. Setting AT_CTRL_R.SW_TUNE_EN enables software to write to this field and its contents are reflected on tuning_cclk_sel.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>REDGEPHCODE</name>
                <description>Right Edge Phase code. Reading this field returns the phase code value used by Auto-tuning engine to sample data on Right edge of sampling window.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LEDGEPHCODE</name>
                <description>Left Edge Phase code. Reading this field returns the phase code value used by Auto-tuning engine to sample data on Left edge of sampling window.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSDV1</name>
                <description>These bits of the AT_STAT_R register are reserved. They always return 0.</description>
                <lsb>24</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DL2BUSY</name>
                <description>Delay Line 2 busy indication. If this bit is set then it indicates that the cclk_rx delay line is in the process of delay code updation.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>EMBEDDEDCONTR</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_EMBEDDEDCONTR</headerStructName>
          <access>read-write</access>
          <addressOffset>0xC6C</addressOffset>
          <register>
            <name>EMBEDDEDCTRLR</name>
            <description>This register controls the embedded device. When the Host Controller is connected to a removable device, this register is not used.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMCLKPIN</name>
                <description>Number of Clock Pins (SD Mode)</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD3</name>
                <description>This bit (RSVD_3) of the EMBEDDED_CTRL_R register is reserved. It always returns 0.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NUMINTPIN</name>
                <description>Number of Interrupt Input Pins</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD76</name>
                <description>These bits (RSVD_7_6) of the EMBEDDED_CTRL_R register are reserved. They always return 0.</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BUSWIDTHPRESET</name>
                <description>Bus Width Preset (SD Mode)</description>
                <lsb>8</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD15</name>
                <description>This bit (RSVD_15) of the EMBEDDED_CTRL_R register is reserved. It always returns 0.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKPINSEL</name>
                <description>Clock Pin Select (SD Mode)</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>RSVD19</name>
                <description>This bit (RSVD_19) of the EMBEDDED_CTRL_R register is reserved. It always returns 0.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INTPINSEL</name>
                <description>Interrupt Pin Select</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>RSVD23</name>
                <description>This bit (RSVD_23) of the EMBEDDED_CTRL_R register is reserved. It always returns 0.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BACKENDPWRCTRL</name>
                <description>Back-End Power Control (SD Mode)</description>
                <lsb>24</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>RSVD31</name>
                <description>This bit (RSVD_31) of the EMBEDDED_CTRL_R register is reserved. It always returns 0.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PENALTY0</name>
            <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>PENALTY[%s]</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
