ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer bytes to transfer</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer bytes to transfer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of buffer bytes transferred since last START, updated after the END or STOPPED events</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer bytes transferred since last START, updated after the END or STOPPED events.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTAMOUNT</name>
            <description>Number of buffer bytes transferred since last START, continuously updated</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer bytes transferred since last START, continuously updated.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TESTCTRL</name>
          <description>Control signals used during test of ADC</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ICTRL</name>
              <description>Current control. See design description for coding</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SWITCH</name>
              <description>Swap positive and negative input. See design description for coding</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SHORT</name>
              <description>Short input. Used to measure offset of ADC. See design description for coding</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TST</name>
              <description>Test bus for ADC core. See design description for coding</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ENINMUX</name>
              <description>Will enable the input mux in the ADC, so the resistor strings can be connected even when the analog core is powered down. See design description for coding</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>PWRUP</name>
              <description>Power-up time</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6us</name>
                  <description>6 us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10us</name>
                  <description>10 us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15us</name>
                  <description>15 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20us</name>
                  <description>20 us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALDMAWREN</name>
              <description>Enable writing calibration values to DMA</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Writing values is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Writing values is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINCALEN</name>
              <description>Enables the use of linear calibration values TRIM.LINCALCOEFF[n]</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Use of linear calibration is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Use of linear calibration is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL</name>
          <description>Calibration control for offset and gain error</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALOFFSET</name>
              <description>Calibration control for offset error. Sign-magnitude coding</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default setting</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxPos</name>
                  <description>Maximum positive offset</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxNeg</name>
                  <description>maximum negative offset</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALGAIN</name>
              <description>Offset binary coding</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default gain, for +1/2 input (assume full-scale = +-1) the output will be 1024</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High gain setting</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low gain setting</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALGAIN3V3</name>
              <description>Offset binary coding</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default gain, for +1/2 input (assume full-scale = +-1) the output will be 1024</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High gain setting</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low gain setting</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALGAIN5V0</name>
              <description>Offset binary coding</description>
              <lsb>24</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default gain, for +1/2 input (assume full-scale = +-1) the output will be 1024</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High gain setting</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low gain setting</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CALREF</name>
          <description>Calibration control for reference voltage</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VREF</name>
              <description>Offset binary coding</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default vref, in typical corner VREF=1.024V</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Low output code (high reference voltage)</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>High output code (low reference voltage)</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFLPFDISABLE</name>
              <description>Disable the internal reference low pass filter</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>IREF</name>
              <description>Calibration control for reference current. See design description for coding</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>VREFTC</name>
              <description>Calibration code for reference temperature coefficient. See design description for coding</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>LDO</name>
              <description>Calibration code for LDO VREF. See design description for coding</description>
              <lsb>24</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NOISESHAPE</name>
          <description>Enable noise shaping</description>
          <addressOffset>0x654</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NOISESHAPE</name>
              <description>Enable noise shaping</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable noiseshaping. Oversampling based on accumulate and average.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Audio</name>
                  <description>Noiseshaping and decimating. Larger passband. Provides a 100kS/s cut off frequency, 8x the oversampling ratio. See design description for more information</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Accuracy</name>
                  <description>Noiseshaping and decimating. Smaller passband. Recommended resolution setting is 14 bits. Provides a 10kS/s cut off frequency, 32x the oversampling ratio. See design description for more information</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stage1</name>
                  <description>Result from common 1st stage filter. For debugging only</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EASYDMAMODE</name>
          <description>Configure EasyDMA mode.</description>
          <addressOffset>0x658</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPOP</name>
              <description>Enable low-power operation, or use low-latency</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LowLat</name>
                  <description>Low-latency operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low-power operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TERMINATEONAHBERROR</name>
          <description>Enable EasyDMA termination on AHB error</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable termination on AHB error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Termination on AHB error disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Termination on AHB error enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBERRORADDRESS</name>
          <description>Address of the last AHB error transaction</description>
          <addressOffset>0x664</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SAADC_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>PWRUP</name>
            <description>Override the PWRUP signal to the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALCDAC</name>
            <description>Override the CAL_CDAC signal to the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SAADC_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>ATB0CONFIG</name>
            <description>Analog Test Bus 0 (ATB0) configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB0</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InMux</name>
                    <description>ATB0 connected to PADC_INMUX, available on PADC_IN</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vref</name>
                    <description>ATB0 connected to VREF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VrefBuff</name>
                    <description>ATB0 connected to VREF_BUFF</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VrefIbpsr10U</name>
                    <description>ATB0 connected to ATB_PADC_VREF_IBPSR_10U for current measurement</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VrefIbps3U</name>
                    <description>ATB0 connected to ATB_PADC_VREF_IBPS_3U</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VrefLpfDisabled</name>
                    <description>ATB0 connected to VREF, internal reference with LPF bypassed.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare1</name>
                    <description>Spare pin</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare2</name>
                    <description>Spare pin</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
