ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
        <register>
          <name>AUTOCOLRESSTATUS</name>
          <description>NFC Auto collision resolution Error Status register</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERROR</name>
              <description>Auto collision resolution status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoCollision</name>
                  <description>Auto collision resolution resolved, no error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cascade1Fail</name>
                  <description>Auto collision resolution failed at Cascade level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cascade2Fail</name>
                  <description>Auto collision resolution failed at Cascade level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cascade3Fail</name>
                  <description>Auto collision resolution failed at Cascade level 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>FRAMESTATUS</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_NFCT_FRAMESTATUS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x40C</addressOffset>
          <register>
            <name>RX</name>
            <description>Result of last incoming frame</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRCERROR</name>
                <description>No valid end of frame (EoF) detected</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CRCCorrect</name>
                    <description>Valid CRC detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRCError</name>
                    <description>CRC received does not match local check</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PARITYSTATUS</name>
                <description>Parity status of received frame</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ParityOK</name>
                    <description>Frame received with parity OK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ParityError</name>
                    <description>Frame received with parity error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OVERRUN</name>
                <description>Overrun detected</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverrun</name>
                    <description>No overrun detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Overrun</name>
                    <description>Overrun error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INVALIDSELCMD</name>
                <description>Invalid SEL_CMD field of a received SDD_REQ</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Valid</name>
                    <description>No invalid SEL_CMD</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Invalid</name>
                    <description>Invalid SEL_CMD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INVALIDSELPAR</name>
                <description>Invalid SEL_PAR field of a received SDD_REQ</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Valid</name>
                    <description>No invalid SEL_PAR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Invalid</name>
                    <description>Invalid SEL_PAR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>NFCTAGSTATE</name>
          <description>Current operating state of NFC tag</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NFCTAGSTATE</name>
              <description>NfcTag state</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled or sense</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RampUp</name>
                  <description>RampUp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Idle</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Receive</name>
                  <description>Receive</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FrameDelay</name>
                  <description>FrameDelay</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transmit</name>
                  <description>Transmit</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPSTATE</name>
          <description>Sleep state during automatic collision resolution</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLEEPSTATE</name>
              <description>Reflects the sleep state during automatic collision resolution. Set to IDLE
        by a GOIDLE task. Set to SLEEP_A when a valid SLEEP_REQ frame is received or by a
        GOSLEEP task.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>State is IDLE.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SleepA</name>
                  <description>State is SLEEP_A.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BYTESWRITTENTORAM</name>
          <description>Number of bytes written to RAM</description>
          <addressOffset>0x424</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BYTESWRITTENTORAM</name>
              <description>Number of bytes written to RAM.</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCFRAMINGCORESTATE</name>
          <description>NFC Framing Core State</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NFCFRAMINGCORESTATE</name>
              <description>Current NFC Framing Core State</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PadNotConnected</name>
                  <description>NFC pads not connected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFCT peripheral disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sense</name>
                  <description>In sense state. But it is transitive state, so visible for one peripheral clock cycle only.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RampUp</name>
                  <description>NFCT peripheral ramping up</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CollisionResolution</name>
                  <description>Automatic collision resolution in progress</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>In selected state</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transmitting</name>
                  <description>Transmit in progress</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TransmitFinishing</name>
                  <description>Transmit finishing, reading from the RAM buffer completed</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCANTICOLRESSTATE</name>
          <description>Automatic collision resolution (anti-collision) state</description>
          <addressOffset>0x42C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NFCANTICOLRESSTATE</name>
              <description>Current Automatic collision resolution (anti-collision) state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>State IDLE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_SENS_RES</name>
                  <description>State IDLE_SENS_RES</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A0</name>
                  <description>State READY_A0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A0_SEL_RES</name>
                  <description>State READY_A0_SEL_RES</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A0_SDD_RES</name>
                  <description>State READY_A0_SDD_RES</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A1</name>
                  <description>State READY_A1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A1_SEL_RES</name>
                  <description>State READY_A1_SEL_RES</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A1_SDD_RES</name>
                  <description>State READY_A1_SDD_RES</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A2</name>
                  <description>State READY_A2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A2_SEL_RES</name>
                  <description>State READY_A2_SEL_RES</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY_A2_SDD_RES</name>
                  <description>State READY_A2_SDD_RES</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_A</name>
                  <description>State ACTIVE_A</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP_A</name>
                  <description>State SLEEP_A</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP_A_SENS_RES</name>
                  <description>State SLEEP_A_SENS_RES</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEASUREDFREQ</name>
          <description>The frequency measured on the 13.56 MHz NFC carrier signal</description>
          <addressOffset>0x434</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEASUREDFREQ</name>
              <description>The frequency measured on the 13.56 MHz NFC carrier signal. This result is produced in response to triggering FREQMEASURE. Frequency = 16 MHz * MEASUREDFREQ / 1000</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ROSCCALVALUE</name>
          <description>The current value used by the ring oscillator</description>
          <addressOffset>0x438</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROSCCALVALUE</name>
              <description>The current value used by the ring oscillator. Either given by the calibration engine, or by the override value.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Minimum</name>
                  <description>Minimum frequency</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nominal</name>
                  <description>Nominal frequency</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Maximum</name>
                  <description>Maximum frequency</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIELDPRESENT</name>
          <description>Indicates the presence or not of a valid field</description>
          <addressOffset>0x43C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FIELDPRESENT</name>
              <description>Indicates if a valid field is present. Available only in the activated state.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoField</name>
                  <description>No valid field detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FieldPresent</name>
                  <description>Valid field detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKDETECT</name>
              <description>Indicates if the low level has locked to the field</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLocked</name>
                  <description>Not locked to field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Locked to field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFBPDREF</name>
          <description>Current value of common-mode voltage level at pad</description>
          <addressOffset>0x440</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CMFBPDREF</name>
              <description>Current value of common-mode voltage level at pad.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMFBPDREF0</name>
                  <description>800 mV</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBPDREF1</name>
                  <description>900 mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBPDREF2</name>
                  <description>1 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBPDREF3</name>
                  <description>1.1 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMFBPDREF4</name>
                  <description>Spare</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Register to enable NFC functionality</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Register to enable NFC functionality</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable NFC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable NFC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMEDELAYMIN</name>
          <description>Minimum frame delay</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000480</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAMEDELAYMIN</name>
              <description>Minimum frame delay in number of 13.56 MHz clock cycles</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMEDELAYMAX</name>
          <description>Maximum frame delay</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAMEDELAYMAX</name>
              <description>Maximum frame delay in number of 13.56 MHz clock cycles</description>
              <lsb>0</lsb>
              <msb>19</msb>
            </field>
          </fields>
        </register>
