ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr.svd
        <register>
          <name>SENSRES</name>
          <description>NFC-A SENS_RES auto-response settings</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BITFRAMESDD</name>
              <description>Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDD00000</name>
                  <description>SDD pattern 00000</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00001</name>
                  <description>SDD pattern 00001</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00010</name>
                  <description>SDD pattern 00010</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00100</name>
                  <description>SDD pattern 00100</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD01000</name>
                  <description>SDD pattern 01000</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD10000</name>
                  <description>SDD pattern 10000</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFU5</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>NFCIDSIZE</name>
              <description>NFCID1 size. This value is used by the auto collision resolution engine.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCID1Single</name>
                  <description>NFCID1 size: single (4 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Double</name>
                  <description>NFCID1 size: double (7 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Triple</name>
                  <description>NFCID1 size: triple (10 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLATFCONFIG</name>
              <description>Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RFU74</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SELRES</name>
          <description>NFC-A SEL_RES auto-response settings</description>
          <addressOffset>0x5A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RFU10</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CASCADE</name>
              <description>Cascade as defined by the b3 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification (controlled by hardware, shall be 0)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>RFU43</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>3</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>5</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RFU7</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMODCONFIG</name>
          <description>Configuration settings for demodulation</description>
          <addressOffset>0x61C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDGEDETRSTDELAY</name>
              <description>Time between the falling edge of the NFC pulse and the time when reset is applied, in number of 13.56 MHz clocks</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>DEMODEDGEDETECT</name>
              <description>Selects if an edge detector is enabled to detect the rising edge of an NFC pulse</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No edge detector - the rising edge of LOCKDETECT or DEMODLEV is used directly</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Edge detector enabled on the rising edge of the NFC pulse</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMBOLTOLLOWER</name>
          <description>Configuration register for the tolerance of the received NFC pulse width</description>
          <addressOffset>0x628</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYMBOLTOLLOWER</name>
              <description>Minimum allowable received NFC pulse width, given in pulses of 13.56 MHz clock</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMBOLTOLUPPER</name>
          <description>Configuration register for the tolerance of the received NFC pulse width</description>
          <addressOffset>0x62C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYMBOLTOLUPPER</name>
              <description>Maximum allowable received NFC pulse width, given in pulses of 13.56 MHz clock</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTINUOUSSUBCARRIER</name>
          <description>Selects continuous sub-carrier transmission</description>
          <addressOffset>0x630</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONTINUOUSSUBCARRIER</name>
              <description>Selects continuous sub-carrier transmission</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal modulation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Carrier</name>
                  <description>Continuous sub-carrier transmission</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKRECCONFIG</name>
          <description>Configuration bits for NFCT_CLOCKREC_GF22N</description>
          <addressOffset>0x63C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000121</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLERXTHRESHOLD</name>
              <description>Enables RX threshold of the sine-to-square converter. 1b_0 enables TX threshold.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RXTHRESHOLD</name>
              <description>Select RX threshold voltage</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ENABLEOUTPUT</name>
              <description>Enables the NFCT_REF_13M56_AO_0V8 output</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDEENABLE</name>
          <description>Enables override functionality.</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRENPWRUP</name>
              <description>Override enable for OVERRIDE_PWRUP</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>OVRENMODULATION</name>
              <description>Override enable for modulation on/off</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OVRENCMFBPDREF</name>
              <description>Spare</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OVRENROSCCALCODE</name>
              <description>Override enable for ROSCCALCODE</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>OVRENROSCCALEN</name>
              <description>Override enable for ROSCCALEN</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>OVRENCLAMPEN1V6</name>
              <description>Override enable for the 1V6 clamp</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>OVRENCLAMPEN2V6</name>
              <description>Override enable for the 2V6 clamp</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>OVRENPWRUPRES</name>
              <description>Override enable for pwrUpRes</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OVRENRSTPEAKLEV</name>
              <description>Override enable for nfcRstPeakLev</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRENRSTEDCLOCK</name>
              <description>Override enable for nfcRstEdgeDetectClockRec</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OVRENFIELDDET</name>
              <description>Override enable for pwrupNfcFieldDetect</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENPWRUPNFCLDO</name>
              <description>Override enable for pwrupNfcLdo</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>OVRENRETAIN</name>
              <description>Override enable for retainAna</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>OVRENPADNFCCFG</name>
              <description>Override enable for padNfcCfg</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPWRUPNFC</name>
          <description>Override value for pwrupNfc</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALPWRUPNFC</name>
              <description>Override value for pwrupNfc</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALMODULATION</name>
          <description>Override value for modulation on/off</description>
          <addressOffset>0x664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALMODULATION</name>
              <description>Override value for modulation on/off</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALROSCCALCODE</name>
          <description>Override value for the calibration word for the oscillator</description>
          <addressOffset>0x674</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALROSCCALCODE</name>
              <description>Override value for the calibration word for the oscillator</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALCLAMPEN1V6</name>
          <description>Override value for the 1V6 clamp</description>
          <addressOffset>0x678</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALCLAMPEN1V6</name>
              <description>Override value for the 1V6 clamp</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALCLAMPEN2V6</name>
          <description>Override value for the 2V6 clamp</description>
          <addressOffset>0x67C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALCLAMPEN2V6</name>
              <description>Override value for the 2V6 clamp</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CALENNFC</name>
          <description>Value for the signal CALEN going to the oscillator</description>
          <addressOffset>0x680</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALENNFC</name>
              <description>Value for the calibration word for the oscillator</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCAL</name>
          <description>Controls auto-calibration at NFCT module enabling</description>
          <addressOffset>0x684</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROSCEN</name>
              <description>Controls auto-calibration at NFCT module enabling</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No auto-calibration at module enablin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable auto-calibration at module enabling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHUNTREGCONFIG</name>
          <description>Configuration for NFCT_SHUNTREG_GF22N</description>
          <addressOffset>0x68C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00031145</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOWTHRESHOLD</name>
              <description>Tune low threshold voltage of peak detector</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>HIGHTHRESHOLD</name>
              <description>Tune high threshold voltage of peak detector</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>TUNECOMMONMODE</name>
              <description>Tune common-mode voltage of peak detectors</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>ENABLECOMMONMODE</name>
              <description>Enable/disable common-mode voltage circuit</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>DIVIDER</name>
              <description>Adjust capacitive divider ratio</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass parts of RC filter for NFC envelope</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nobypass</name>
                  <description>No bypass</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOADMODCONFIG</name>
          <description>Configuration for load modulation</description>
          <addressOffset>0x690</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001F00</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOADMODCONFIGOFF</name>
              <description>Load modulation value when modulation is off. The value has to be 0. Changing
        it would give undesired results.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>LOADMODCONFIGON</name>
              <description>Load modulation value when modulation is on</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALCMFBPDREF</name>
          <description>Override value for cmfbPdRef</description>
          <addressOffset>0x69C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRVALCMFBPDREF</name>
              <description>Override value for cmfbPdRef</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKDETECTWINDOW</name>
          <description>Adjust window size on falling edge of lock detect filter used for demodulation</description>
          <addressOffset>0x6A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKDETECTWINDOW</name>
              <description>Adjust window size on falling edge of lock detect filter used for demodulation</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PNFCCFGRET</name>
          <description>Configuration of constant bits in P_NFCCFG_RET_0V8</description>
          <addressOffset>0x6A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000031</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTVALCOMMON</name>
              <description>Initial value of common-mode voltage level at pad</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ENABLECOMMONREGULATION</name>
              <description>Enable/disable common-regulation at pad</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ENABLEBULKBIASSHUNT</name>
              <description>Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
